"""
Овен (21.03 - 20.04)
Телець (21.04 - 21.05)
Близнята (22.05 - 21.06)
Рак (22.06 - 22.07)
Лев (23.07 - 21.08)
Діва (22.08 - 23.09)
Терези (24.09 - 23.10)
Скорпіон (24.10 - 22.11)
Стрілець (23.11 - 21.12)
Козеріг (22.12 - 20.01)
Водолій (21.01 - 18.02)
Риби (19.02 - 20.03)
"""
import datetime
import calendar

day=int(input('Введіть день вашого народження: '))
month=int(input('Введіть місяць вашого народження: '))

max_day=calendar.monthrange(2023, month)[1]

if not (1 <= day <= 31 and 1 <= month <= 12):
    print('Помилка, день або місяць неправильний!')
    exit()

user_date = datetime.date(2023, month, day)
if datetime.date(2023, 3, 21) <= user_date <= datetime.date(2023, 4, 20):
    print('Ти Овен')
    print('Представникам вогняних знаків — Овнам, Левам і Стрільцям — у 2023 році випаде щасливий білет. Ваші ініціативність, ентузіазм, лідерські якості матимуть великий попит, а ідеї надихатимуть інших на видатні досягнення. Цього року ви — допитливі мандрівники, що відкривають нові світи й тестують себе на якість взаємин з оточенням, на витривалість і вміння досягати мети.')
elif datetime.date(2023, 4, 21) <= user_date <= datetime.date (2023, 5, 20):
    print('Ти Телець')
    print('"Дайте мені точку опертя, і я зрушу світ!" — гасло представників знаків Землі на 2023 рік, який усіма способами спонукатиме послабити зайву обережність й опанувати продуктивну активність. Скрізь, де ви вкладатимете сили й час, є шанс отримати матеріальний результат і прокачати такі важливі для вас суперздібності, як терпіння, працьовитість, стійкість, надійність. Цього року представники знаків Телець, Діва, Козоріг — сміливі реалісти.')
elif datetime.date(2023, 5, 21) <= user_date <= datetime.date (2023, 6, 20):
    print('Ти Близнята')
    print('На представників знаків повітряної стихії — Близнят, Терезів і Водолія — чекає динамічний рік, який сприятиме проявам ініціативи в комунікації й інтелектуальній діяльності. Рушійними силами 2023-го стануть ваше натхнення, легкість і життєлюбність. А експертність, здатність до компромісів і підтримка надійних партнерів допоможуть досягти задуманого. Цього року ви — активні стратеги.')
elif datetime.date(2023, 6, 21) <= user_date <= datetime.date (2023, 7, 22):
    print('Ти Рак')
    print('Представникам знаків Води — Рака, Скорпіона, Риб — рік нагадуватиме контрастний душ: то підноситиме догори і спонукатиме до відкритості та творчості, то занурюватиме на звичні глибини, даруючи опору та спокій. Цього року ви — завбачливі ентузіасти. Ваші уява та інтуїція будуть на висоті. Якщо у вас є заповітна мрія або ціль, саме ці здібності допоможуть швидше наблизитися до неї.')
elif datetime.date(2023, 7, 23) <= user_date <= datetime.date (2023, 8, 22):
    print('Ти Лев')
    print('Представникам вогняних знаків — Овнам, Левам і Стрільцям — у 2023 році випаде щасливий білет. Ваші ініціативність, ентузіазм, лідерські якості матимуть великий попит, а ідеї надихатимуть інших на видатні досягнення. Цього року ви — допитливі мандрівники, що відкривають нові світи й тестують себе на якість взаємин з оточенням, на витривалість і вміння досягати мети.')
elif datetime.date(2023, 8, 23) <= user_date <= datetime.date (2023, 9, 22):
    print('Ти Діва')
    print('"Дайте мені точку опертя, і я зрушу світ!" — гасло представників знаків Землі на 2023 рік, який усіма способами спонукатиме послабити зайву обережність й опанувати продуктивну активність. Скрізь, де ви вкладатимете сили й час, є шанс отримати матеріальний результат і прокачати такі важливі для вас суперздібності, як терпіння, працьовитість, стійкість, надійність. Цього року представники знаків Телець, Діва, Козоріг — сміливі реалісти.')
elif datetime.date(2023, 9, 23) <= user_date <= datetime.date (2023, 10, 22):
    print('Ти Терези')
    print('На представників знаків повітряної стихії — Близнят, Терезів і Водолія — чекає динамічний рік, який сприятиме проявам ініціативи в комунікації й інтелектуальній діяльності. Рушійними силами 2023-го стануть ваше натхнення, легкість і життєлюбність. А експертність, здатність до компромісів і підтримка надійних партнерів допоможуть досягти задуманого. Цього року ви — активні стратеги.')
elif datetime.date(2023, 10, 23) <= user_date <= datetime.date (2023, 11, 22):
    print('Ти Скорпіон')
    print('Представникам знаків Води — Рака, Скорпіона, Риб — рік нагадуватиме контрастний душ: то підноситиме догори і спонукатиме до відкритості та творчості, то занурюватиме на звичні глибини, даруючи опору та спокій. Цього року ви — завбачливі ентузіасти. Ваші уява та інтуїція будуть на висоті. Якщо у вас є заповітна мрія або ціль, саме ці здібності допоможуть швидше наблизитися до неї.')
elif datetime.date(2023, 11, 23) <= user_date <= datetime.date (2023, 12, 21):
    print('Ти Стрелець')
    print('Представникам вогняних знаків — Овнам, Левам і Стрільцям — у 2023 році випаде щасливий білет. Ваші ініціативність, ентузіазм, лідерські якості матимуть великий попит, а ідеї надихатимуть інших на видатні досягнення. Цього року ви — допитливі мандрівники, що відкривають нові світи й тестують себе на якість взаємин з оточенням, на витривалість і вміння досягати мети.')
elif datetime.date(2023, 12, 22) <= user_date <= datetime.date (2023, 1, 19):
    print('Ти Козеріг')
    print('"Дайте мені точку опертя, і я зрушу світ!" — гасло представників знаків Землі на 2023 рік, який усіма способами спонукатиме послабити зайву обережність й опанувати продуктивну активність. Скрізь, де ви вкладатимете сили й час, є шанс отримати матеріальний результат і прокачати такі важливі для вас суперздібності, як терпіння, працьовитість, стійкість, надійність. Цього року представники знаків Телець, Діва, Козоріг — сміливі реалісти.')
elif datetime.date(2023, 1, 20) <= user_date <= datetime.date (2023, 2, 19):
    print('Ти Водолій')
    print('На представників знаків повітряної стихії — Близнят, Терезів і Водолія — чекає динамічний рік, який сприятиме проявам ініціативи в комунікації й інтелектуальній діяльності. Рушійними силами 2023-го стануть ваше натхнення, легкість і життєлюбність. А експертність, здатність до компромісів і підтримка надійних партнерів допоможуть досягти задуманого. Цього року ви — активні стратеги.')
elif datetime.date(2023, 2, 20) <= user_date <= datetime.date (2023, 3, 20):
    print('Ти Риби')
    print('Представникам знаків Води — Рака, Скорпіона, Риб — рік нагадуватиме контрастний душ: то підноситиме догори і спонукатиме до відкритості та творчості, то занурюватиме на звичні глибини, даруючи опору та спокій. Цього року ви — завбачливі ентузіасти. Ваші уява та інтуїція будуть на висоті. Якщо у вас є заповітна мрія або ціль, саме ці здібності допоможуть швидше наблизитися до неї.')


